{
    "pages": [
        {
            "id": "liner-web",
            "title": "Liner\nWeb",
            "src": "liner-web-video.mp4",
            "type": "undertook",
            "url": "https://getliner.com",
            "participants": [
                "Liner team"
            ],
            "technologies": [
                "React, ",
                "Redux, ",
                "Sass"
            ],
            "duration": "2 weeks",
            "description": "Liner is a web highlighter for desktop and mobile devices. Users can manage and share their highlights or get recommendations on pages based on their highlights on Liner website.",
            "roles": [
                "Developed a RelevantPages component located at the bottom of the document detail page and a RecommendationSideBar component located on the side of all pages.",
                "Improved the main feed page's rendering speed and user experience with API response caching, React Context, and session storage.",
                "Reorganized user interface of MyHighlights page with SCSS.",
                "Restructing front-end project structure and components hierarchies to optimze rendering speed and reduce redundant re-rendering."
            ]
        },
        {
            "id": "liner-be",
            "title": "Liner\nBrowser Extension",
            "type": "undertook",
            "url": "https://getliner.com",
            "participants": [
                "Janghyeok Choe"
            ],
            "technologies": [
                "Vanilla JS"
            ],
            "duration": "2 weeks",
            "description": "Liner is a web highlighter for desktop and mobile devices. Liner browser extension provides users with the ability to highlight sentences on a variety of web pages, get recommendations for a different page based on their highlights, and view top highlights highlighted by others.",
            "roles": [
                "Implemented a function using a tree algorithm that traverses the DOM to determine if the Selection object is a highlightable object containing only text nodes.",
                "Developed an algorithm that finds sentences highlighted by many people and underlines them using tree algorithm and KMP string matching algorithm.",
                "Developed a function that displays points next to the scroll bar which express the location of the highlight and scroll the screen to the corresponding highlight when a user clicks them."
            ]
        },
        {
            "id": "quantcash",
            "title": "QuantCash",
            "type": "personal project",
            "src": "quantcash.mp4",
            "repository": "https://github.com/CHOEJANGHYEOK/quantcash",
            "participants": [
                "Chanhyup Kim, ",
                "Hwarim Hyun, ",
                "Janghyeok Choe, ",
                "Sangjoon Park"
            ],
            "technologies": [
                "React, ",
                "Redux, ",
                "Jest, ",
                "Enzyme, ",
                "Django, ",
                "Redis, ",
                "Celery, ",
                "Docker, ",
                "AWS, ",
                "Travis CI, ",
                "SonaCloud, ",
                "Eslint, ",
                "Pylint, ",
                "Service Worker"
            ],
            "duration": "3 months",
            "description": "QuantCash is a web platform that provides an open community to make, test, evaluate, and compare quant algorithms written by various users.its by receiving subscription fees from investors. Quant algorithm developers can code their algorithms with a simple web IDE that we provide. They also can share their code snippets with others at the snippet market page. Every algorithms' profits are evaluated everyday and ranked at the leaderboard page. Users of course can mange their algorithms at the manage page and check their algorithms' backtesting results or daily, weekly, monthly profits at each one's dashboard page.",
            "roles": [
                "Mainly developed front-end using a TDD approach with React, Redux, Jest and Enzyme.",
                "Implemented REST APIs with Django.",
                "Set up Travis CI to automate test and build process.",
                "Designed overall user interface of the site."
            ]
        },
        {
            "id": "hybrid-location-manager",
            "title": "Hybrid Location Manager",
            "type": "personal project",
            "participants": [
                "Donghyun Kim, ",
                "Janghyeok Choe, ",
                "Sangsoo Park, ",
                "Naver Map"
            ],
            "technologies": [
                "Java, ",
                "GSON, ",
                "Android Framework, ",
                "Google Map API"
            ],
            "duration": "3 months",
            "description": "Hybrid Location Manager is a project to improve the current location providing service of Naver maps in the Android environment. Using the hidden markov model and gps information, we developed an algorithm with performance improvements of about 5% over existing services based on F-score.",
            "roles": [
                "Studied Hidden Markov Model with my team and applied it to the position compensation algorithm.",
                "Developed a view of the map app using Google Maps API and the Android framework.",
                "Filtered raw gps information through filtering algorithms and made the result to be displayed as a point or path on the screen in real time."
            ]
        },
        {
            "id": "personal-website",
            "title": "Personal Webstie",
            "src": "pw-video.mp4",
            "type": "personal project",
            "repository": "https://github.com/CHOEJANGHYEOK/janghyeok",
            "participants": ["ME!"],
            "technologies": [
                "TypeScript, ",
                "Next.js, ",
                "Tailwind CSS"
            ],
            "duration": "2 weeks",
            "description": "You are here. My personal website!"
        }
    ]
}